app/views/posts/index.html.erb

INSERT INTO "posts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2016-12-16 02:09:24 UTC], ["updated_at", 2016-12-16 02:09:24 UTC]]
---
        <h3><b><%= post.title %></b></h3>
        <h5>Created: <span class="w3-opacity"><%= post.created_at.strftime("%d %b. %Y") %></span></h5>

SELECT "comments".* FROM "comments"
---
          <div class="w3-col m4 w3-hide-small">
            <p><span class="w3-padding-large w3-right"><b>Comments  </b> <span class="w3-tag"><%= post.comments.length %></span></span></p>