app/views/posts/show.html.erb

SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = 4 ORDER BY "comments"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
        <div class="w3-col m4 w3-hide-small">
          <p><span class="w3-padding-large w3-right"><b>Comments  </b> <span class="w3-tag"><%= @post.comments.length %></span></span></p>