app/controllers/posts_controller.rb

  def index
    @post = Post.all
    @new = Post.create(params[:text])
---
SELECT "posts".* FROM "posts"
INSERT INTO "posts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", 2016-12-16 02:09:24 UTC], ["updated_at", 2016-12-16 02:09:24 UTC]]

  def show
    @post = Post.find(params[:id].to_i)
    @comment = Comment.where(post_id: @post)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = 4 ORDER BY "comments"."id" ASC LIMIT $1  [["LIMIT", 1]]